# IFCExternalServiceUIData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExternalServiceUIData Methods
IFCExternalServiceUIData Class See Also
---
The IFCExternalServiceUIData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParentHwnd | return the parent handle |
| GetRevitElementIds | return the list of revit Element Ids |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace